frontend/controllers/UsersController.php

    public function actionCreate()
    {
        $model = new RegistrationForm();
        $preferences = Preferences::find()->asArray()->all();
        $model->scenario = 'create';

        if (Yii::$app->request->isAjax && $model->load(Yii::$app->request->post()))
        {
            Yii::$app->response->format = 'json';
            return \yii\widgets\ActiveForm::validate($model);
        }

        if ($model->load(Yii::$app->request->post())) {
            $model->picture = UploadedFile::getInstance($model, 'picture');

            if ($model->picture && !empty($model->picture) && $model->validate()) {
                $uid = uniqid(time(), true);
                $fileName = $uid . '.' . $model->picture->extension;
                $filePath = Yii::getAlias('@anyname')."\uploads\\" . $fileName;
                if ($model->picture->saveAs($filePath)) {
                    $model->picture = $fileName;
                }
                $user           = new Users();
                $user->username = $model['username'];
                $user->email    = $model['email'];
                $user->password = md5($model['password']);
                $user->picture  = $model['picture'];
                if ($user->save(false)) {
---
INSERT INTO `users` (`username`, `email`, `password`, `picture`) VALUES ('dfggdfgd', 'admin@admin.comdfgrettr', '21232f297a57a5a743894a0e4a801fc3', '15242196585ad9bf0a129a24.43611480.jpg')

                        $usersPreference = new UsersPreferences();
                        $usersPreference->user_id = $user->id;
                        $usersPreference->preference_id = $value;
                        $usersPreference->save(false);
---
INSERT INTO `users_preferences` (`user_id`, `preference_id`) VALUES (6, 1)

                    $model->picture = $oldimage;
                }

                $user           = Users::findOne($model->id);
                $user->username = $model->username;
                $user->email    = $model->email;
                $user->picture  = $model->picture;
                if ($user->save(false)) {
                    //Delete old
                    UsersPreferences::deleteAll('user_id = :user_id', [':user_id' => $user->id]);
---
SELECT * FROM `users` WHERE `id`=2
UPDATE `users` SET `username`='harjeet', `email`='admin1@admin.com', `picture`='15242189195ad9bc27465d08.51800535.jpg' WHERE `id`=3
DELETE FROM `users_preferences` WHERE user_id = 2

                        $usersPreference = new UsersPreferences();
                        $usersPreference->user_id = $user->id;
                        $usersPreference->preference_id = $value;
                        $usersPreference->save(false);
---
INSERT INTO `users_preferences` (`user_id`, `preference_id`) VALUES (2, 1)

    protected function findModel($id)
    {
        if (($model = Users::findOne($id)) !== null) {
---
SELECT * FROM `users` WHERE `id`='2'