frontend/models/Users.php

    public function getUserPic($id='')
    {
        $user = Users::find()
            ->where(['id' => $id])
            ->one();
---
SELECT * FROM `users` WHERE `id`=3